---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeTopDir1Generic
source: html/ba94665a-61ad-8b20-27e1-18551c82ba65.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeTopDir1Generic Property

"Top/Exterior Major Bar Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemBarTypeTopDir1Generic { get; }
```